; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
; params: python3 spanner-generator.py 5 3 5 --seed 674592 --problem-name prob_s5_n3_l5_s674592
(define (problem prob_s5_n3_l5_s674592)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 - spanner
     nut1 nut2 nut3 - nut
     location1 location2 location3 location4 location5 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location3)
    (useable spanner1)
    (at spanner2 location4)
    (useable spanner2)
    (at spanner3 location1)
    (useable spanner3)
    (at spanner4 location1)
    (useable spanner4)
    (at spanner5 location2)
    (useable spanner5)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (link shed location1)
    (link location5 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 3
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 3
3. (pickup_spanner location2 spanner5 bob)
   deleted: (at spanner5 location2)
   added: (carrying bob spanner5)
   goals met: 0 of 3
4. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 3
5. (pickup_spanner location3 spanner1 bob)
   deleted: (at spanner1 location3)
   added: (carrying bob spanner1)
   goals met: 0 of 3
6. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 3
7. (pickup_spanner location4 spanner2 bob)
   deleted: (at spanner2 location4)
   added: (carrying bob spanner2)
   goals met: 0 of 3
8. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 3
9. (walk location5 gate bob)
   deleted: (at bob location5)
   added: (at bob gate)
   goals met: 0 of 3
10. (tighten_nut gate spanner1 bob nut3)
   deleted: (loose nut3) (useable spanner1)
   added: (tightened nut3)
   goals met: 1 of 3
11. (tighten_nut gate spanner2 bob nut2)
   deleted: (loose nut2) (useable spanner2)
   added: (tightened nut2)
   goals met: 2 of 3
12. (tighten_nut gate spanner5 bob nut1)
   deleted: (loose nut1) (useable spanner5)
   added: (tightened nut1)
   goals met: 3 of 3
